micropython/micropython/ports/espressif/boards/targett_module_clip_wrover/mpconfigboard.h
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2019 Scott Shawcroft for Adafruit Industries
//
// SPDX-License-Identifier: MIT

#pragma once

// Micropython setup

// Same setup as the Saola board but with no Neopixel on board

#define MICROPY_HW_BOARD_NAME       "Targett Module Clip w/Wrover"
#define MICROPY_HW_MCU_NAME         "ESP32S2"

// #define MICROPY_HW_NEOPIXEL (&pin_GPIO18)
